tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"

cask_args appdir: "/Applications"

brew "aria2"
brew "clang-format"
brew "diff-so-fancy"
brew "fd"
brew "gh"
brew "git"
brew "git-lfs"
brew "grc"
brew "grpcurl"
brew "node"
brew "ripgrep"
brew "the_silver_searcher"
brew "tree"

cask "1Password"
cask "bettertouchtool"
cask "bitbar"
cask "hex-fiend"
cask "istat-menus"
cask "iterm2"
cask "kaleidoscope"
cask "moom"
cask "omnifocus"
cask "tower"
