tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"

cask_args appdir: "/Applications"

brew "aria2"
brew "bat"
brew "bazelisk"
brew "clang-format"
brew "buildifier"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gnupg"
brew "grc"
brew "grpcurl"
brew "hyperfine"
brew "less" # newer to allow better -F handling
brew "neovim"
brew "node"
brew "pinentry-mac"
brew "ripgrep"
brew "shellcheck"
brew "the_silver_searcher"
brew "tree"

cask "1Password"
cask "bartender"
cask "camo-studio"
cask "hex-fiend"
cask "cleanshot"
cask "istat-menus"
cask "iterm2"
cask "kaleidoscope"
cask "omnifocus"
cask "raycast"
cask "tower"
